README.md

# Table of Contents

1.  [Rectangle](#org1b069f3)
    1.  [rectangle.h](#org12742e8)
        1.  [Setup](#org05c5975)
        2.  [Body](#orga813d32)
        3.  [End](#orgc2dfc4e)
    2.  [rectangle.cpp](#org00b3c59)
        1.  [Doxygen header](#orgf8a6d84)
        2.  [Libraries](#orgd798222)
        3.  [Constructors](#orgceecc46)
        4.  [Operators](#org5e2d7b8)
        5.  [Functions](#org2d62f86)
2.  [Rhombus](#org764c530)
    1.  [rhombus.h](#org6e01f21)
        1.  [Setup](#org26a3be7)
        2.  [Body](#orgb727ee3)
        3.  [End](#orge519e18)
    2.  [rhombus.cpp](#org70876de)
        1.  [Doxygen header](#org979587d)
        2.  [Libraries](#org94a4cb6)
        3.  [Constructors](#org7573467)
        4.  [Operators](#orga31caf9)
        5.  [Functions](#org1c7e4ca)
3.  [Main](#org1b82cce)
    1.  [Doxygen header](#org79cda8e)
    2.  [Include libraries](#org8f7dc1b)
    3.  [body](#org91c6715)
        1.  [open](#org340f1c2)
        2.  [Rectangle A](#org2987517)
        3.  [Rectangle B](#org19d22cf)
        4.  [Rectangle C](#orge2d6b9d)
        5.  [Rectangle D](#org9d86295)
        6.  [close](#orgfae987b)



<a id="org1b069f3"></a>

# Rectangle


<a id="org12742e8"></a>

## rectangle.h


<a id="org05c5975"></a>

### Setup

1.  Doxygen header

        /*! \file rectangle.h
        	\brief Declaration of the class Rectangle
        
        	Details.
        */

2.  open ifndef

        #ifndef RECTANGLE_H
        #define RECTANGLE_H

3.  namespace

        using namespace std;


<a id="orga813d32"></a>

### Body

1.  open

        /// @class Rectangle
        /// @brief to manage an object with the shape of a rectangle
        class Rectangle
        {

2.  private descriptors

        private:
        	int width;
        	int length;

3.  public descriptors

        public:
    
    1.  Constructors
    
            /// Default constructor
            Rectangle();
            /// Copy constructor
            Rectangle(const Rectangle & R);
            /// Init constructor
            Rectangle(int w, int l);
            /// Destructor
            ~Rectangle();
    
    2.  operators
    
            /// Operators
            /// assign
            Rectangle& operator=(const Rectangle &r);
            /// isequal
            bool operator==(const Rectangle &r);
    
    3.  Functions
    
            void SetDim(int w, int l);
            void SetLength(int l);
            void SetWidth(int w);
            
            void GetDim(int &w, int &l);
            int GetLength();
            int GetWidth();
            
            int GetArea();
            int GetPerimeter();


<a id="orgc2dfc4e"></a>

### End

1.  close class

        };

2.  close ifndef (endif)

        #endif


<a id="org00b3c59"></a>

## rectangle.cpp


<a id="orgf8a6d84"></a>

### Doxygen header

    /// \file rectangle.cpp
    ///	\brief class Rectangle: implementation of the functions
    ///
    ///	Details.
    ///


<a id="orgd798222"></a>

### Libraries

    #include <iostream>
    
    #include "rectangle.h"


<a id="orgceecc46"></a>

### Constructors

1.  Default constructor

        /// @brief default constructor
        Rectangle::Rectangle()
        {
        	cout << "Rectangle - constructor - default" << endl;
        
        	width = 0;
        	length = 0;
        }

2.  Copy constructor

        /// @brief copy constructor
        /// @param R rectangle to copy.
        Rectangle::Rectangle(const Rectangle & r)
        {
        	cout << "Rectangle - constructor - copy" << endl;
        
            width = r.width;
            length = r.length;
        }

3.  Init constructor

        /// @brief init constructor
        /// @param w width in pixels
        /// @param h length in pixels
        Rectangle::Rectangle(int w, int l)
        {
        	width = 0;
        	length = 0;
        
        	cout << "Rectangle - constructor" << endl;
        
        	if (w <= 0) cout << "WARNING: Rectangle - constructor: width should be > 0" << endl;
        	else width = w;
        
        	if (l <= 0) cout << "WARNING: Rectangle - constructor: length should be > 0" << endl;
        	else length = l;
        }

4.  Destructor

        /// @brief destructor
        Rectangle::~Rectangle()
        {
        	cout << "Rectangle - destructor" << endl;
        }


<a id="org5e2d7b8"></a>

### Operators

    /// ----------------- Operators ---------------------------

1.  =

        /// @brief overload of assign operator
        /// @param reference to the object on the right height of the operator
        /// @return reference to the object on the left height of the operator
        Rectangle& Rectangle::operator=(const Rectangle &r)
        {
            cout << "Rectangle - operator =" << endl;
        
            width = r.width;
            length = r.length;
        
            /// "this" is the pointer to the current object
            /// (the one who called the function).
            return *this;
        }

2.  ==

        /// @brief overload of operator ==
        /// @param reference to the object on the right height of the operator
        /// @return true if the two objects have the same width and the same length, false if not.
        bool Rectangle::operator==(const Rectangle &r)
        {
            cout << "Rectangle - operator ==" << endl;
        
            return (( r.width == width && r.length == length ) ? true : false);
            //if( r.width == width && r.length == length ) return true; return false;
        }


<a id="org2d62f86"></a>

### Functions

1.  Set functions

    1.  SetWidth
    
            /// @brief set width of the object
            /// @param w width in pixels
            void Rectangle::SetWidth(int w)
            {
            	if (w < 0)
                {
            		cout << "WARNING: Rectangle - SetWidth: width should be > 0" << endl;
            		return;
            	}
            	width = w;
            }
    
    2.  SetLength
    
            /// @brief set length of the object
            /// @param l length in pixels
            void Rectangle::SetLength(int l)
            {
            	if (l < 0)
                {
            		cout << "WARNING: Rectangle - SetLength: length should be > 0" << endl;
            		return;
            	}
            	length = l;
            }
    
    3.  SetDim
    
            /// @brief set width and length of the object
            /// @param w width in pixels
            /// @param l length in pixels
            void Rectangle::SetDim(int w, int l)
            {
            	SetWidth(w);
            	SetLength(l);
            }

2.  Get functions

    1.  GetWidth
    
            /// @brief get width of the object
            int Rectangle::GetWidth()
            {
                return width;
            }
    
    2.  GetLength
    
            /// @brief get length of the object
            int Rectangle::GetLength()
            {
                return length;
            }
    
    3.  GetDim
    
            /// @brief get width and length of the object
            /// @param w width in pixels
            /// @param l length in pixels
            void Rectangle::GetDim(int &w, int &l)
            {
                w=width;
                l=length;
            }
    
    4.  GetArea
    
            /// @brief calculate and return the area of the rectangle
            int Rectangle::GetArea()
            {
            		return width * length;
            }
    
    5.  GetPerimeter
    
            /// @brief calculate and return the perimeter of the rectangle
            int Rectangle::GetPerimeter()
            {
            		return 2 * ( width + length );
            }


<a id="org764c530"></a>

# Rhombus


<a id="org6e01f21"></a>

## rhombus.h


<a id="org26a3be7"></a>

### Setup

1.  Doxygen header

        /*! \file rhombus.h
        	\brief Declaration of the class Rhombus
        
        	Details.
        */

2.  open ifndef

        #ifndef RHOMBUS_H
        #define RHOMBUS_H

3.  namespace

        using namespace std;


<a id="orgb727ee3"></a>

### Body

1.  open

        /// @class Rhombus
        /// @brief to manage an object with the shape of a rhombus
        class Rhombus
        {

2.  private descriptors

        private:
        	/// the two diagonals exaustively describe a rhombus.
        	int diagonal1;
        	int diagonal2;

3.  public descriptors

        public:
    
    1.  Constructors
    
            /// Default constructor
            Rhombus();
            /// Copy constructor
            Rhombus(const Rhombus & R);
            /// Init constructor
            Rhombus(int d1, int d2);
            /// Destructor
            ~Rhombus();
    
    2.  operators
    
            /// Operators
            /// assign
            Rhombus& operator=(const Rhombus &r);
            /// ==
            bool operator==(const Rhombus &r);
    
    3.  Functions
    
            void SetDim(int d1, int d2);
            void SetD1(int d1);
            void SetD2(int d2);
            
            void GetDim(int &d1, int &d2);
            int GetD1();
            int GetD2();
            
            int GetArea();
            int GetSide();
            int GetPerimeter();
