README.md


<a id="orge519e18"></a>

### End

1.  close class

        };

2.  close ifndef (endif)

        #endif


<a id="org70876de"></a>

## rhombus.cpp


<a id="org979587d"></a>

### Doxygen header

    ///	\file rhombus.cpp
    ///	\brief class Rhombus: implementation of the functions
    ///
    ///	Details.


<a id="org94a4cb6"></a>

### Libraries

    #include <iostream>
    #include <cmath>
    
    #include "rhombus.h"


<a id="org7573467"></a>

### Constructors

1.  Default constructor

        ///	@brief default constructor
        Rhombus::Rhombus()
        {
        	cout << "Rhombus - constructor - default" << endl;
        
        	diagonal1 = 0;
        	diagonal2 = 0;
        }

2.  Copy constructor

        ///	@brief copy constructor
        ///	@param r rhombus to copy.
        Rhombus::Rhombus(const Rhombus & r)
        {
        	cout << "Rhombus - constructor - copy" << endl;
        
            diagonal1 = r.diagonal1;
            diagonal2 = r.diagonal2;
        }

3.  Init constructor

        ///	@brief init constructor
        ///	@param d1 diagonal 1 in pixels
        ///	@param d2 diagonal 2 in pixels
        Rhombus::Rhombus(int d1, int d2)
        {
        	diagonal1 = 0;
        	diagonal2 = 0;
        
        	cout << "Rhombus - constructor" << endl;
        
        	if (d1 <= 0) cout << "WARNING: Rhombus - constructor: diagonal 1 should be > 0" << endl;
        	else diagonal1 = d1;
        
        	if (d2 <= 0) cout << "WARNING: Rhombus - constructor: diagonal 2 should be > 0" << endl;
        	else diagonal2 = d2;
        }

4.  Destructor

        ///	@brief destructor
        Rhombus::~Rhombus()
        {
        	cout << "Rhombus - destructor" << endl;
        }


<a id="orga31caf9"></a>

### Operators

    /// ----------------- Operators ---------------------------

1.  =

        ///	@brief overload of assign operator
        ///	@param reference to the object on the right height of the operator
        ///	@return reference to the object on the left height of the operator
        Rhombus& Rhombus::operator=(const Rhombus &r)
        {
        		cout << "Rhombus - operator =" << endl;
        
        		diagonal1 = r.diagonal1;
        		diagonal2 = r.diagonal2;
        
        		/// "this" is the pointer to the current object
        		/// (the one who called the function).
        		return *this;
        }

2.  ==

        ///	@brief overload of operator ==
        ///	@param reference to the object on the right height of the operator
        ///	@return true if the two objects have the same width and the same length, false if not.
        bool Rhombus::operator==(const Rhombus &r)
        {
        		cout << "Rhombus - operator ==" << endl;
        		return (( r.diagonal1 == diagonal1 && r.diagonal2 == diagonal2 ) ? true : false);
        }


<a id="org1c7e4ca"></a>

### Functions

1.  Set functions

    1.  SetD1
    
            ///	@brief set diagonal 1 of the rhombus
            ///	@param D1 in pixels
            void Rhombus::SetD1(int D1)
            {
            	if (D1 < 0)
            	{
            		cout << "WARNING: Rhombus - SetD1: diagonal 1 should be > 0" << endl;
            		return;
            	}
            	diagonal1 = D1;
            }
    
    2.  SetLength
    
            ///	@brief set diagonal 2 of the rhombus
            ///	@param D2 in pixels
            void Rhombus::SetD2(int D2)
            {
            	if (D2 < 0)
            	{
            		cout << "WARNING: Rhombus - SetD2: diagonal 2 should be > 0" << endl;
            		return;
            	}
            	diagonal2 = D2;
            }
    
    3.  SetDim
    
            ///	@brief set both diagonals of the rhombus
            ///	@param D1 in pixels
            ///	@param D2 in pixels
            void Rhombus::SetDim(int D1, int D2)
            {
            	SetD1(D1);
            	SetD2(D2);
            }

2.  Get functions

    1.  GetD1
    
            ///	@brief get diagonal 1 of the rhombus
            int Rhombus::GetD1()
            {
            		return diagonal1;
            }
    
    2.  GetD2
    
            ///	@brief get diagonal 2 of the rhombus
            int Rhombus::GetD2()
            {
            		return diagonal2;
            }
    
    3.  GetDim
    
            ///	@brief get both diagonals of the rhombus
            ///	@param d1 diagonal1 in pixels
            ///	@param d2 diagonal2 in pixels
            void Rhombus::GetDim(int &d1, int &d2)
            {
            		d1=diagonal1;
            		d2=diagonal2;
            }
    
    4.  GetArea
    
            ///	@brief calculate and return the area of the rhombus
            ///	@return the area of the rhombus in square pixels
            int Rhombus::GetArea()
            {
            		return (int)(diagonal1 * diagonal2)/2;
            }
    
    5.  GetSide
    
            ///	@brief calculate and return the side of the rhombus
            ///	NB: all 4 sides of a rhombus are equal
            ///	@return length of the side of the rhombus, in pixels.
            int Rhombus::GetSide()
            {
            		return (int)(sqrt(diagonal1*diagonal1+diagonal2*diagonal2)/2);
            }
    
    6.  GetPerimeter
    
            ///	@brief calculate and return the perimeter of the rhombus
            ///	@return the perimeter of the rhombus in pixels
            int Rhombus::GetPerimeter()
            {
            		return 4*(GetSide());
            }


<a id="org1b82cce"></a>

# Main


<a id="org79cda8e"></a>

## Doxygen header

    /*!
      \file main.cpp
      \brief Fiddling with rectangles and rhombi
    */


<a id="org8f7dc1b"></a>

## Include libraries

    #include <iostream>
    
    #include "rectangle.h"
    #include "rhombus.h"


<a id="org91c6715"></a>

## body


<a id="org340f1c2"></a>

### open

    int main()
    {


<a id="org2987517"></a>

### Rectangle A

The Rectangle A object, called `objRectA`, is created using the **init constructor** giving it specific values for width and length.  

    /// Create Rectangle A giving it specific values.
    /// To do this, the init constructor is called.
    Rectangle objRectA(10,5);

`GetWidth` and `GetLength` are used to extract the Rectangle A dimensions just set, which are then sent to `cout` to be displayed.  

    /// Get Rectangle A dimensions using "Get" functions.
    cout << "\nRectangle A:\n";
    /// test GetWidth:
    cout << "width: " << objRectA.GetWidth() << endl;
    /// test GetLenght:
    cout << "length: " << objRectA.GetLength() << endl;

`SetWidth` changes the Rectangle A width.  

    /// Change Rectangle A width using SetWidth.
    objRectA.SetWidth(4);
    cout << "New width: " << objRectA.GetWidth() << endl;


<a id="org19d22cf"></a>

### Rectangle B

The Rectangle B object, called `objRectB`, is created using the **default constructor** so with the default values: 0 and 0.  

    /// Create Rectangle B using the default "Rectangle" constructor.
    /// It will give it the default width and length values: 0 and 0.
    Rectangle objRectB;
    cout << "\nRectangle B:\n";
    cout << "Default values: " << "(" << objRectB.GetWidth() << ", " << objRectB.GetLength() << ")\n";

`SetDim` is used to give Rectangle B new values.  

    /// Set dimensions for the Rectangle B, overwriting the defaults.
    objRectB.SetDim(3,7);
    cout << "New values: " << "(" << objRectB.GetWidth() << ", " << objRectB.GetLength() << ")\n\n";

-   `lToPrint` and `wToPrint` integer variables are created and initialized to 0.
-   They are then changed by `GetDim` to the length and width of Rectangle B.
-   Finally they&rsquo;re sent to `cout` to be displayed.

    /// variables to store and then print length and width.
    /// They're needed by GetDim (indirect addressing).
    int wToPrint, lToPrint; wToPrint = lToPrint = (int)0;
    
    /// test GetDim
    objRectA.GetDim(wToPrint,lToPrint);
    cout << "Width and length: (" << wToPrint << ", " << lToPrint << ")\n\n";


<a id="orge2d6b9d"></a>

### Rectangle C

`objRectC` is created inheight a pair of brackets `{  }`, which delimit its *scope*.  
When the compiler encounters the closing bracket the destructor is called to get rid of rectangle C, because we&rsquo;re now moving outheight of its scope.  

    /// An object's ending scope causes its destruction
    {
        Rectangle objRectC;
        cout << "Rectangle C is not yet destroyed\n";
    }
    cout << "Rectangle C is now destroyed\n";
