README.md


<a id="org9d86295"></a>

### Rectangle D

`objRectD` is created as a copy of `objRectB`.  

    /// copy constructor creates Rectangle D as a copy of Rectangle B
    Rectangle objRectD(objRectB);
    cout << "Rectangle D (copy of Rectangle B): " << "(" << objRectD.GetWidth() << ", " << objRectD.GetLength() << ")\n";


<a id="orgfae987b"></a>

### close

    }

